<!--     <h3>Основной поиск</h3>
      <dl>
      <dt>Для того, чтобы осуществить поиск нужно просто ввести искомые слово или фразу.</dt>
      <dd>В работу алгоритма поисковой машины заложено отбрасывание, т.е. исключение из индексирования, определённых слов, которые часто называют <a href="#" data-reveal-id="myModalNoise">«шумовыми словами»</a> (их часто называют "стоп-слова"). Такими словами могут быть предлоги, суффиксы, причастия, междометия и частицы:</dd>
<dd>а, без, более, бы, был, была, были, было, быть, в, вам, вас, весь, во, вот, все, всего, всех, вы, где, да, даже, для, до, его, ее, если, есть, ещё, же, за, здесь, и, из, из-за, или, им, их, к, как, как-то, ко, когда, кто, ли, либо, мне, может, мы, на, надо, наш, не, него, неё, нет, ни, них, но, ну, о, об, однако, он, она, они, оно, от, очень, по, под, при, с, со, так, также, такой, там, те, тем, то, того, тоже, той, только, том, ты, у, уже, хотя, чего, чей, чем, что, чтобы, чьё, чья, эта, эти, это, я</dd>
<h3>Расширенный поиск</h3>
        <dd>Вы можете ограничить несколько слов или фраз с помощью И, ИЛИ</dd>
<dt>Поиск по всем словоформам</dt>
	<dd>Это метод поиска разделяет фразу на отдельные слова и генерирует все спряжения и склонения для каждого слова в поисковой фразе. Поиск слова, обитать, находит фразы обитать, обитающий, обители, обитель, обители, и обителей и т. д.</dd>

      </dl>

<div id="myModalNoise" class="reveal-modal">
 	<h2>Шумовые слова и Стоп-слова</h2>
 	<p>В работу алгоритма поисковой машины заложено отбрасывание, т.е. исключение из индексирования, определённых слов, которые часто называют "шумовыми словами" (их часто называют "стоп-слова"). Такими словами могут быть предлоги, суффиксы, причастия, междометия и частицы:</p>
	<p>а, без, более, бы, был, была, были, было, быть, в, вам, вас, весь, во, вот, все, всего, всех, вы, где, да, даже, для, до, его, ее, если, есть, ещё, же, за, здесь, и, из, из-за, или, им, их, к, как, как-то, ко, когда, кто, ли, либо, мне, может, мы, на, надо, наш, не, него, неё, нет, ни, них, но, ну, о, об, однако, он, она, они, оно, от, очень, по, под, при, с, со, так, также, такой, там, те, тем, то, того, тоже, той, только, том, ты, у, уже, хотя, чего, чей, чем, что, чтобы, чьё, чья, эта, эти, это, я</p>
 	<a class="close-reveal-modal">&#215;</a>
</div>

<div id="myModalScope" class="reveal-modal" style="display: none; opacity: 1; visibility: hidden; top: -180px;">
 	<h2>Область поиска</h2>
 	<h3>Поиск по всем словоформам</h3>
	<p>Это метод поиска разделяет фразу на отдельные слова и генерирует все спряжения и склонения для каждого слова в поисковой фразе. Поиск слова, обитать, находит фразы обитать, обитающий, обители, обитель, обители, и обителей и т. д.</p>
	<h3>Поиск по точному соответсвию</h3>
	<p>Эта опция выполняет поиск точных совпадений указанных слов или фраз, используемых в строке поиска.</p>
	<h3>Примечание</h3>
	<p>Общие слова, такие как "и", "есть", "но", пропускаются при поиске. Список всех шумовых слов выглядит следующим образом:</p>
	<p>а, без, более, бы, был, была, были, было, быть, в, вам, вас, весь, во, вот, все, всего, всех, вы, где, да, даже, для, до, его, ее, если, есть, ещё, же, за, здесь, и, из, из-за, или, им, их, к, как, как-то, ко, когда, кто, ли, либо, мне, может, мы, на, надо, наш, не, него, неё, нет, ни, них, но, ну, о, об, однако, он, она, они, оно, от, очень, по, под, при, с, со, так, также, такой, там, те, тем, то, того, тоже, той, только, том, ты, у, уже, хотя, чего, чей, чем, что, чтобы, чьё, чья, эта, эти, это, я</p><a class="close-reveal-modal">×</a>
</div> -->